[
    {
        "index": 1,
        "title": "Psi-Net: Shape and boundary aware joint multi-task deep network for medical image segmentation",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8857339/",
        "authors": [
            "Balamurali Murugesan",
            "Kaushik Sarveswaran",
            "Sharath M Shankaranarayana",
            "Keerthi Ram",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "23 July 2019",
        "conference": "2019 41st Annual international conference of the IEEE engineering in medicine and biology society (EMBC)",
        "pages": "7223-7226",
        "publisher": "IEEE",
        "description": "Image segmentation is a primary task in many medical applications. Recently, many deep networks derived from U-Net has been extensively used in various medical image segmentation tasks. However, in most of the cases, networks similar to U-net produce coarse and non-smooth segmentations with lots of discontinuities. To improve and refine the performance of U-Net like networks, we propose the use of parallel decoders which along with performing the mask predictions also perform contour prediction and distance map estimation. The contour and distance map aid in ensuring smoothness in the segmentation predictions. To facilitate joint training of three tasks, we propose a novel architecture called Psi-Net with a single encoder and three parallel decoders (thus having a shape of Ψ), one decoder to learn the segmentation mask prediction and other two decoders to learn the auxiliary tasks of contour …",
        "citations": 210
    },
    {
        "index": 2,
        "title": "Local pulse wave velocity: theory, methods, advancements, and clinical applications",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8778763/",
        "authors": [
            "PM Nabeel",
            "V Raj Kiran",
            "Jayaraj Joseph",
            "VV Abhidev",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "29 July 2019",
        "conference": "IEEE Reviews in Biomedical Engineering",
        "pages": "13",
        "publisher": "74-112",
        "description": "IEEE",
        "citations": 0
    },
    {
        "index": 3,
        "title": "Non-contact sensing of neonatal pulse rate using camera-based imaging: a clinical feasibility study",
        "paperLink": "https://iopscience.iop.org/article/10.1088/1361-6579/ab755c/meta",
        "authors": [
            "M Paul",
            "S Karthik",
            "J Joseph",
            "M Sivaprakasam",
            "J Kumutha",
            "S Leonhardt",
            "C Hoog Antink"
        ],
        "publicationDate": "09 March 2020",
        "conference": "Physiological measurement",
        "pages": "41",
        "publisher": "2",
        "description": "024001",
        "citations": 0
    },
    {
        "index": 4,
        "title": "Fast body part segmentation and tracking of neonatal video data using deep learning",
        "paperLink": "https://link.springer.com/article/10.1007/s11517-020-02251-4",
        "authors": [
            "Christoph Hoog Antink",
            "Joana Carlos Mesquita Ferreira",
            "Michael Paul",
            "Simon Lyra",
            "Konrad Heimann",
            "Srinivasa Karthik",
            "Jayaraj Joseph",
            "Kumutha Jayaraman",
            "Thorsten Orlikowsky",
            "Mohanasankar Sivaprakasam",
            "Steffen Leonhardt"
        ],
        "publicationDate": "Invalid Date",
        "conference": "Medical & Biological Engineering & Computing",
        "pages": "58",
        "publisher": "3049-3061",
        "description": "Springer Berlin Heidelberg",
        "citations": 0
    },
    {
        "index": 5,
        "title": "Ecgnet: Deep network for arrhythmia classification",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8438739/",
        "authors": [
            "Balamurali Murugesan",
            "Vignesh Ravichandran",
            "Keerthi Ram",
            "Preejith SP",
            "Jayaraj Joseph",
            "Sharath M Shankaranarayana",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "11 June 2018",
        "conference": "2018 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "Cardiac arrhythmias are presently diagnosed by manual interpretation of Electrocardiography (ECG) signals. Automated ECG interpretation is required to perform efficient screening of arrhythmia from long term ECG data. Existing automated ECG interpretation tools however require extensive preprocessing and knowledge to determine relevant features. Thus there is a need for a comprehensive feature extractor and classifier to analyze ECG signals. In this paper, we propose three robust deep neural network (DNN) architectures to perform feature extraction and classification of a given two second ECG signal. The first network is a Convolutional Neural Network (CNN) with multiple kernel sizes, the second network is a Long Short Term Memory (LSTM) network and the third network is a combination of CNN and LSTM based feature extractor, CLSTM network. The proposed networks are end to end networks which …",
        "citations": 99
    },
    {
        "index": 6,
        "title": "Single-source PPG-based local pulse wave velocity measurement: a potential cuffless blood pressure estimation technique",
        "paperLink": "https://iopscience.iop.org/article/10.1088/1361-6579/aa9550/meta",
        "authors": [
            "PM Nabeel",
            "J Jayaraj",
            "S Mohanasankar"
        ],
        "publicationDate": "28 November 2017",
        "conference": "Physiological measurement",
        "pages": "38",
        "publisher": "12",
        "description": "2122",
        "citations": 0
    },
    {
        "index": 7,
        "title": "Arterial blood pressure estimation from local pulse wave velocity using dual-element photoplethysmograph probe",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8301581/",
        "authors": [
            "PM Nabeel",
            "Srinivasa Karthik",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "23 February 2018",
        "conference": "IEEE Transactions on Instrumentation and Measurement",
        "pages": "67",
        "publisher": "6",
        "description": "1399-1408",
        "citations": 0
    },
    {
        "index": 8,
        "title": "Bi-modal arterial compliance probe for calibration-free cuffless blood pressure estimation",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8440703/",
        "authors": [
            "PM Nabeel",
            "Joseph Jayaraj",
            "Karthik Srinivasa",
            "Sivaprakasam Mohanasankar",
            "M Chenniappan"
        ],
        "publicationDate": "20 August 2018",
        "conference": "IEEE Transactions on Biomedical Engineering",
        "pages": "65",
        "publisher": "11",
        "description": "2392-2404",
        "citations": 0
    },
    {
        "index": 9,
        "title": "Physiological signal based work stress detection using unobtrusive sensors",
        "paperLink": "https://iopscience.iop.org/article/10.1088/2057-1976/aadbd4/meta",
        "authors": [
            "AS Anusha",
            "Joy Jose",
            "SP Preejith",
            "Joseph Jayaraj",
            "Sivaprakasam Mohanasankar"
        ],
        "publicationDate": "07 September 2018",
        "conference": "Biomedical Physics & Engineering Express",
        "pages": "4",
        "publisher": "6",
        "description": "065001",
        "citations": 0
    },
    {
        "index": 10,
        "title": "RPnet: A Deep Learning approach for robust R Peak detection in noisy ECG",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/9176084/",
        "authors": [
            "Sricharan Vijayarangan",
            "R Vignesh",
            "Balamurali Murugesan",
            "SP Preejith",
            "Jayaraj Joseph",
            "Mohansankar Sivaprakasam"
        ],
        "publicationDate": "20 July 2020",
        "conference": "2020 42nd annual international conference of the IEEE engineering in medicine & biology society (EMBC)",
        "pages": "345-348",
        "publisher": "IEEE",
        "description": "Automatic detection of R-peaks in an Electrocardiogram signal is crucial in a multitude of applications including Heart Rate Variability (HRV) analysis and Cardio Vascular Disease(CVD) diagnosis. Although there have been numerous approaches that have successfully addressed the problem, there has been a notable dip in the performance of these existing detectors on ECG episodes that contain noise and HRV Irregulates. On the other hand, Deep Learning(DL) based methods have shown to be adept at modelling data that contain noise. In image to image translation, Unet is the fundamental block in many of the networks. In this work, a novel application of the Unet combined with Inception and Residual blocks is proposed to perform the extraction of R-peaks from an ECG. Furthermore, the problem formulation also robustly deals with issues of variability and sparsity of ECG R-peaks. The proposed network was …",
        "citations": 70
    },
    {
        "index": 11,
        "title": "RespNet: A deep learning model for extraction of respiration from photoplethysmogram",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8856301/",
        "authors": [
            "Vignesh Ravichandran",
            "Balamurali Murugesan",
            "Vaishali Balakarthikeyan",
            "Keerthi Ram",
            "SP Preejith",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "23 July 2019",
        "conference": "2019 41st annual international conference of the IEEE engineering in medicine and biology society (EMBC)",
        "pages": "5556-5559",
        "publisher": "IEEE",
        "description": "Respiratory ailments afflict a wide range of people and manifests itself through conditions like asthma and sleep apnea. Continuous monitoring of chronic respiratory ailments is seldom used outside the intensive care ward due to the large size and cost of the monitoring system. While Electrocardiogram (ECG) based respiration extraction is a validated approach, its adoption is limited by access to a suitable continuous ECG monitor. Recently, due to the widespread adoption of wearable smartwatches with in-built Photoplethysmogram (PPG) sensor, it is being considered as a viable candidate for continuous and unobtrusive respiration monitoring. Research in this domain, however, has been predominantly focussed on estimating respiration rate from PPG. In this work, a novel end-to-end deep learning network called RespNet is proposed to perform the task of extracting the respiration signal from a given input PPG …",
        "citations": 70
    },
    {
        "index": 12,
        "title": "Technical validation of ARTSENS–An image free device for evaluation of vascular stiffness",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7105853/",
        "authors": [
            "Jayaraj Joseph",
            "Ravikumar Radhakrishnan",
            "Shitanshu Kusmakar",
            "Arya Sree Thrivikraman",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "12 May 2015",
        "conference": "IEEE journal of translational engineering in health and medicine",
        "pages": "3",
        "publisher": "1-13",
        "description": "IEEE",
        "citations": 0
    },
    {
        "index": 13,
        "title": "Wearable ECG platform for continuous cardiac monitoring",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7590779/",
        "authors": [
            "SP Preejith",
            "R Dhinesh",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "16 August 2016",
        "conference": "2016 38th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)",
        "pages": "623-626",
        "publisher": "IEEE",
        "description": "An ultra-low power ECG platform for continuous and minimally intrusive monitoring for systems with minimal processing capabilities, is presented in this paper. The platform is capable of detecting abnormalities in the ECG signal by extracting and analyzing features related to various cardiac trends. The platform is built to continuously operate on any of the 12 leads and the presented work includes a single lead implementation that works on lead I or II. A single lead, wearable ECG patch that can detect rhythm based arrhythmias and continuously monitor beat-to-beat heart rate and respiratory rate has been developed. In addition, the device stores raw ECG waveform locally and is designed to run for 10 days on a single charge. The ECG patch works in conjunction with a front end device or tablet and updates the results on the tablet interface. Upon detection of an abnormality or an arrhythmia the device switches to …",
        "citations": 64
    },
    {
        "index": 14,
        "title": "Accelerometer based system for continuous respiratory rate monitoring",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7985870/",
        "authors": [
            "SP Preejith",
            "Ahamed Jeelani",
            "Paresh Maniyar",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "07 May 2017",
        "conference": "2017 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "171-176",
        "publisher": "IEEE",
        "description": "Recent advances in sensor technologies, wireless connectivity, cloud storage and availability of compact hardware allow for designing of cost effective physiological monitoring devices. There is a growing demand for wearable technologies with continuous and minimally intrusive physiological parameter monitoring capabilities. Continuous respiratory rate monitoring using a three-axis accelerometer from the sternum or abdomen is highly challenging due to motion corruption and presents a potential area of research. A system design for continuous and long term respiratory rate monitoring, in a wearable form factor with capability of remote monitoring is presented in this paper. The device runs on a low power ARM Cortex M0 microcontroller and uses inbuilt BLE (Bluetooth Low energy) module for wireless connectivity. A respiratory rate computation algorithm using motion artifact rejection is implemented on the …",
        "citations": 57
    },
    {
        "index": 15,
        "title": "PPGnet: Deep network for device independent heart rate estimation from photoplethysmogram",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8856989/",
        "authors": [
            "A Shyam",
            "Vignesh Ravichandran",
            "SP Preejith",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "23 July 2019",
        "conference": "2019 41st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)",
        "pages": "1899-1902",
        "publisher": "IEEE",
        "description": "Photoplethysmogram (PPG) is increasingly used to provide monitoring of the cardiovascular system under ambulatory conditions. Wearable devices like smartwatches use PPG to allow long-term unobtrusive monitoring of heart rate in free-living conditions. PPG based heart rate measurement is unfortunately highly susceptible to motion artifacts, particularly when measured from the wrist. Traditional machine learning and deep learning approaches rely on tri-axial accelerometer data along with PPG to perform heart rate estimation. The conventional learning based approaches have not addressed the need for device-specific modeling due to differences in hardware design among PPG devices. In this paper, we propose a novel end-to-end deep learning model to perform heart rate estimation using 8-second length input PPG signal. We evaluate the proposed model on the IEEE SPC 2015 dataset, achieving a mean …",
        "citations": 53
    },
    {
        "index": 16,
        "title": "A magnetic plethysmograph probe for local pulse wave velocity measurement",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8019790/",
        "authors": [
            "PM Nabeel",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "29 August 2017",
        "conference": "IEEE transactions on biomedical circuits and systems",
        "pages": "11",
        "publisher": "5",
        "description": "1065-1076",
        "citations": 0
    },
    {
        "index": 17,
        "title": "Design, development and clinical validation of a wrist-based optical heart rate monitor",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7533786/",
        "authors": [
            "SP Preejith",
            "Annamol Alex",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "15 May 2016",
        "conference": "2016 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "Development in the field of sensor technology, hardware miniaturization, ubiquitous computing and connected solutions paved the way for the development of wearables for continuous physiological parameter monitoring. Continuous heart rate monitoring with clinical accuracy using reflectance photoplethysmogram signals from wrist is highly challenging and presents a potential area of research. In this work, we present a wearable device in a wrist watch form factor for heart rate monitoring. The device runs on a low power ARM cortex M4 microcontroller and integrates a BLE (Bluetooth Low energy) module for wireless connectivity. A heart rate computation algorithm using reflectance photoplethysmography and a 3 axes accelerometer for motion artifact removal is presented in the paper. Heart rate computed by the wrist worn device was validated against heart rate measured using Masimo Radical-7 on 256 …",
        "citations": 51
    },
    {
        "index": 18,
        "title": "Polyp segmentation using generative adversarial network",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8857958/",
        "authors": [
            "JM Poorneshwaran",
            "S Santhosh Kumar",
            "Keerthi Ram",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "23 July 2019",
        "conference": "2019 41St annual international conference of the IEEE engineering in medicine and biology society (EMBC)",
        "pages": "7201-7204",
        "publisher": "IEEE",
        "description": "Colorectal cancer is one of the highest causes of cancer-related death and the patient's survival rate depends on the stage at which polyps are detected. Polyp segmentation is a challenging research task due to variations in the size and shape of polyps leading to necessitate robust approaches for diagnosis. This paper studies the deep generative convolutional framework for the task of polyp segmentation. Here, the analysis of polyp segmentation has been explored with the pix2pix conditional generative adversarial network. On CVC- Clinic dataset, the proposed network achieves Jaccard index of 81.27% and Dice index of 88.48%.",
        "citations": 46
    },
    {
        "index": 19,
        "title": "Automatic measurement of end-diastolic arterial lumen diameter in ARTSENS",
        "paperLink": "https://asmedigitalcollection.asme.org/medicaldevices/article-abstract/9/4/041002/376815",
        "authors": [
            "Ashish Kumar Sahani",
            "Jayaraj Joseph",
            "Ravikumar Radhakrishnan",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "01 December 2015",
        "conference": "Journal of Medical Devices",
        "pages": "9",
        "publisher": "4",
        "description": "041002",
        "citations": 0
    },
    {
        "index": 20,
        "title": "Automated system for imageless evaluation of arterial compliance",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/6345911/",
        "authors": [
            "Ashish Kumar Sahani",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "28 August 2012",
        "conference": "2012 Annual International Conference of the IEEE Engineering in Medicine and Biology Society",
        "pages": "227-231",
        "publisher": "IEEE",
        "description": "Evaluation of arterial compliance is very significant in early detection of coronary heart disease. Here we present an imageless portable system for automated estimation of local arterial compliance, designed to be operated by a general medical practitioner with no prior knowledge of ultrasonography. An algorithm for automatic detection and tracking of the arterial wall locations has been developed to minimize the operator expertise required for measurement. The performance of the automated algorithm was thoroughly characterized using a simulation platform developed for the purpose. Measurements performed on a few human volunteers by untrained personnel clearly illustrated the practical utility of the automatic algorithm during in-vivo tests. The proposed system could be used for developing an inexpensive cardiovascular screening device for large scale deployment in primary health care centers.",
        "citations": 45
    },
    {
        "index": 21,
        "title": "A virtual instrument for automated measurement of arterial compliance",
        "paperLink": "https://asmedigitalcollection.asme.org/medicaldevices/article-abstract/4/4/045004/432596",
        "authors": [
            "Jayaraj Joseph",
            "V Jayashankar"
        ],
        "publicationDate": "01 December 2010",
        "conference": "4",
        "pages": "4",
        "publisher": "045004",
        "description": "Measurement of arterial distensibility is very important in cardiovascular diagnosis for early detection of coronary heart disease and possible prediction of future cardiac events. Conventionally, B-mode ultrasound imaging systems have been used along with expensive vessel wall tracking systems for estimation of arterial distension and calculation of various estimates of compliance. We present a simple instrument for noninvasive in vivo evaluation of arterial compliance using a single element ultrasound transducer. The measurement methodology is initially validated using a proof of concept pilot experiment using a commercial ultrasound pulser-receiver. A prototype system is then developed around a PXI chassis using LABVIEW software. The virtual instrument employs a dynamic threshold algorithm to identify the artery walls and then utilizes a correlation based tracking technique to estimate arterial distension. The …",
        "citations": 43
    },
    {
        "index": 22,
        "title": "A cellulose paper-based fluorescent lateral flow immunoassay for the quantitative detection of cardiac troponin I",
        "paperLink": "https://www.mdpi.com/2079-6374/11/2/49",
        "authors": [
            "Satheesh Natarajan",
            "Joseph Jayaraj",
            "Duarte Miguel F Prazeres"
        ],
        "publicationDate": "14 February 2021",
        "conference": "Biosensors",
        "pages": "11",
        "publisher": "2",
        "description": "49",
        "citations": 0
    },
    {
        "index": 23,
        "title": "ARTSENS® Pen—portable easy-to-use device for carotid stiffness measurement: technology validation and clinical-utility assessment",
        "paperLink": "https://iopscience.iop.org/article/10.1088/2057-1976/ab74ff/meta",
        "authors": [
            "Jayaraj Joseph",
            "Raj Kiran",
            "PM Nabeel",
            "Malay Ilesh Shah",
            "Arun Bhaskar",
            "Chandra Ganesh",
            "Suresh Seshadri",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "24 February 2020",
        "conference": "Biomedical Physics & Engineering Express",
        "pages": "6",
        "publisher": "2",
        "description": "025013",
        "citations": 0
    },
    {
        "index": 24,
        "title": "Interpreting deep neural networks for single-lead ECG arrhythmia classification",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/9176396/",
        "authors": [
            "Sricharan Vijayarangan",
            "Balamurali Murugesan",
            "R Vignesh",
            "SP Preejith",
            "Jayaraj Joseph",
            "Mohansankar Sivaprakasam"
        ],
        "publicationDate": "20 July 2020",
        "conference": "2020 42nd Annual International Conference of the IEEE Engineering in Medicine & Biology Society (EMBC)",
        "pages": "300-303",
        "publisher": "IEEE",
        "description": "Cardiac arrhythmia is a prevalent and significant cause of morbidity and mortality among cardiac ailments. Early diagnosis is crucial in providing intervention for patients suffering from cardiac arrhythmia. Traditionally, diagnosis is performed by examination of the Electrocardiogram (ECG) by a cardiologist. This method of diagnosis is hampered by the lack of accessibility to expert cardiologists. For quite some time, signal processing methods had been used to automate arrhythmia diagnosis. However, these traditional methods require expert knowledge and are unable to model a wide range of arrhythmia. Recently, Deep Learning methods have provided solutions to performing arrhythmia diagnosis at scale. However, the black-box nature of these models prohibit clinical interpretation of cardiac arrhythmia. There is a dire need to correlate the obtained model outputs to the corresponding segments of the ECG. To this …",
        "citations": 38
    },
    {
        "index": 25,
        "title": "Assessment of carotid arterial stiffness in community settings with ARTSENS®",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/9279288/",
        "authors": [
            "Jayaraj Joseph",
            "PM Nabeel",
            "Sudha Ramachandra Rao",
            "Ramachandran Venkatachalam",
            "Malay Ilesh Shah",
            "Prabhdeep Kaur"
        ],
        "publicationDate": "03 December 2020",
        "conference": "IEEE Journal of Translational Engineering in Health and Medicine",
        "pages": "9",
        "publisher": "1-11",
        "description": "IEEE",
        "citations": 0
    },
    {
        "index": 26,
        "title": "Machine Learning based SpO2 Computation Using Reflectance Pulse Oximetry",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8856434/",
        "authors": [
            "Swaathi Venkat",
            "Mohamed Tanveejul PS Arsath PS",
            "Annamol Alex",
            "Preejith SP",
            "Christopher DJ",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "23 July 2019",
        "conference": "2019 41st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)",
        "pages": "482-485",
        "publisher": "IEEE",
        "description": "Continuous monitoring of blood oxygen saturation level (SpO2) is crucial for patients with cardiac and pulmonary disorders and those undergoing surgeries. SpO2 monitoring is widely used in a clinical setting to evaluate the effectiveness of lung medication and ventilator support. Owing to its high levels of accuracy and stability, transmittance pulse oximeters are widely used in the clinical community to compute SpO2. Transmittance pulse oximeters are limited to measure SpO2 only from peripheral sites. Reflectance pulse oximeters, however, can be used at various measurement sites like finger, wrist, chest, forehead, and are immune to faulty measurements due to vasoconstriction and perfusion changes. Reflectance pulse oximeters are not widely adopted in clinical environments due to faulty measurements and inaccurate R-value based calibration methods. In this paper, we present the analysis and observations …",
        "citations": 33
    },
    {
        "index": 27,
        "title": "Arterial compliance probe for cuffless evaluation of carotid pulse pressure",
        "paperLink": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0202480",
        "authors": [
            "Jayaraj Joseph",
            "Nabeel PM",
            "Malay Ilesh Shah",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "16 August 2018",
        "conference": "PloS one",
        "pages": "13",
        "publisher": "8",
        "description": "e0202480",
        "citations": 0
    },
    {
        "index": 28,
        "title": "A paper microfluidics-based fluorescent lateral flow immunoassay for point-of-care diagnostics of non-communicable diseases",
        "paperLink": "https://pubs.rsc.org/en/content/articlehtml/2019/an/c9an01382b",
        "authors": [
            "Satheesh Natarajan",
            "Fengmei Su",
            "Joseph Jayaraj",
            "Malay I Iesh Shah",
            "Youju Huang"
        ],
        "publicationDate": "Invalid Date",
        "conference": "Analyst",
        "pages": "144",
        "publisher": "21",
        "description": "6291-6303",
        "citations": 0
    },
    {
        "index": 29,
        "title": "Evaluation of the algorithm for automatic identification of the common carotid artery in ARTSENS",
        "paperLink": "https://iopscience.iop.org/article/10.1088/0967-3334/35/7/1299/meta",
        "authors": [
            "Ashish Kumar Sahani",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "22 May 2014",
        "conference": "Physiological measurement",
        "pages": "35",
        "publisher": "7",
        "description": "1299",
        "citations": 0
    },
    {
        "index": 30,
        "title": "Development and evaluation of a quantitative fluorescent lateral flow immunoassay for cystatin-C, a renal dysfunction biomarker",
        "paperLink": "https://www.mdpi.com/1424-8220/21/9/3178",
        "authors": [
            "Satheesh Natarajan",
            "Maria C DeRosa",
            "Malay Ilesh Shah",
            "Joseph Jayaraj"
        ],
        "publicationDate": "03 May 2021",
        "conference": "Sensors",
        "pages": "21",
        "publisher": "9",
        "description": "3178",
        "citations": 0
    },
    {
        "index": 31,
        "title": "Image-free ultrasound for local and regional vascular stiffness assessment: The ARTSENS Plus",
        "paperLink": "https://journals.lww.com/jhypertension/fulltext/2022/08000/image_free_ultrasound_for_local_and_regional.12.aspx",
        "authors": [
            "PM Nabeel",
            "Kiran V Raj",
            "Jayaraj Joseph"
        ],
        "publicationDate": "01 August 2022",
        "conference": "Journal of Hypertension",
        "pages": "40",
        "publisher": "8",
        "description": "1537-1544",
        "citations": 0
    },
    {
        "index": 32,
        "title": "Automated measurement of compression-decompression in arterial diameter and wall thickness by image-free ultrasound",
        "paperLink": "https://www.sciencedirect.com/science/article/pii/S0169260720300419",
        "authors": [
            "Kiran V Raj",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "01 October 2020",
        "conference": "Computer Methods and Programs in Biomedicine",
        "pages": "194",
        "publisher": "105557",
        "description": "Elsevier",
        "citations": 0
    },
    {
        "index": 33,
        "title": "Dry electrode optimization for wrist-based electrodermal activity monitoring",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8438595/",
        "authors": [
            "AS Anusha",
            "SP Preejith",
            "Tony J Akl",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "11 June 2018",
        "conference": "2018 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "Recent years of healthcare research has shown an increasing demand and interest in wearable personal healthcare systems. This, when combined with the superior utility of Electrodermal activity (EDA) for diverse applications ranging from market research to human stress and sleep quality analysis to seizure detection have driven significant interest towards optimizing dry electrode designs for EDA monitoring. The conventional wet adhesive Ag/AgCl electrodes, which is the gold standard, is used almost universally and provide excellent signal quality. However, they are less comfortable and not suitable for wearable scenarios that involve continuous long-term monitoring. This study focuses on identifying an optimum dry electrode configuration for monitoring EDA from the wrist. It is hypothesized that parameters like electrode material, interelectrode distance and anatomical location of measurement influence the …",
        "citations": 27
    },
    {
        "index": 34,
        "title": "Magnetic plethysmograph transducers for local blood pulse wave velocity measurement",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/6943995/",
        "authors": [
            "PM Nabeel",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "26 August 2014",
        "conference": "2014 36th Annual International Conference of the IEEE Engineering in Medicine and Biology Society",
        "pages": "1953-1956",
        "publisher": "IEEE",
        "description": "We present the design of magnetic plethysmograph (MPG) transducers for detection of blood pulse waveform and evaluation of local pulse wave velocity (PWV), for potential use in cuffless blood pressure (BP) monitoring. The sensors utilize a Hall effect magnetic field sensor to capture the blood pulse waveform. A strap based design is performed to enable reliable capture of large number of cardiac cycles with relative ease. The ability of the transducer to consistently detect the blood pulse is verified by in-vivo trials on few volunteers. A duality of such transducers is utilized to capture the local PWV at the carotid artery. The pulse transit time (PTT) between the two detected pulse waveforms, measured along a small section of the carotid artery, was evaluated using automated algorithms to ensure consistency of measurements. The correlation between the measured values of local PWV and BP was also investigated …",
        "citations": 27
    },
    {
        "index": 35,
        "title": "An imageless ultrasound device to measure local and regional arterial stiffness",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7058450/",
        "authors": [
            "Ashish Kumar Sahani",
            "Malay Ilesh Shah",
            "Ravikumar Radhakrishnan",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "11 March 2015",
        "conference": "IEEE transactions on biomedical circuits and systems",
        "pages": "10",
        "publisher": "1",
        "description": "200-208",
        "citations": 0
    },
    {
        "index": 36,
        "title": "Variation in local pulse wave velocity over the cardiac cycle: in-vivo validation using dual-MPG arterial compliance probe",
        "paperLink": "https://d-nb.info/1193656540/34#page=113",
        "authors": [
            "PM Nabeel",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "Invalid Date",
        "conference": "13th Russ. Conf. Biomed. Eng.",
        "pages": "June",
        "publisher": "100-103",
        "description": "The biomechanical characteristics of arterial vessels assessed from a short segment (local estimates) are key cardiovascular clinical markers [1]. Local measurement of artery condition has the potential to quantify the prognostic value for the prediction of cardiovascular morbidity and mortality. The elastic properties of large arteries affect locally during the pathophysiological process of various vascular disease such as atherosclerosis [2]. Pulse wave velocity assessed from a short vessel segment (local PWV) has been considered as an indicator of arterial stiffness. Local PWV is shown to correlate well with the mechanical characteristics of an artery over a wide physiological range [1, 3]. Researchers have demonstrated the potential of local PWV to evaluate blood pressure (BP) parameters locally from an artery without using the conventional bladder-type pressure cuff (cuffless technique)[4–6]. Simultaneously measured local PWV, arterial dimensions and local BP parameters are essential to accurately characterize and quantify the elastic behavior of central and peripheral arteries [1].A standard approach for local PWV measurement relies on simultaneous acquisition of the propagating blood pulse waves from two distinct locations at a known separation distance (ΔX) within a small arterial segment. Time taken for the blood pulse wave to travel ΔX distance (pulse transit time [ΔT]), is obtained as the time delay between an identifiable point (fiducial point) on the proximal and distal pulse cycle pair. Following the fundamental distance-time equation, local PWV is then calculated as; Local PWV= ΔX/ΔT. Typically, only one measure of local PWV per …",
        "citations": 25
    },
    {
        "index": 37,
        "title": "Camera fusion for real-time temperature monitoring of neonates using deep learning",
        "paperLink": "https://link.springer.com/article/10.1007/s11517-022-02561-9",
        "authors": [
            "Simon Lyra",
            "Jöran Rixen",
            "Konrad Heimann",
            "Srinivasa Karthik",
            "Jayaraj Joseph",
            "Kumutha Jayaraman",
            "Thorsten Orlikowsky",
            "Mohanasankar Sivaprakasam",
            "Steffen Leonhardt",
            "Christoph Hoog Antink"
        ],
        "publicationDate": "Invalid Date",
        "conference": "Medical & Biological Engineering & Computing",
        "pages": "60",
        "publisher": "6",
        "description": "1787-1800",
        "citations": 0
    },
    {
        "index": 38,
        "title": "Accelerometric patch probe for cuffless blood pressure evaluation from carotid local pulse wave velocity: Design, development, and in vivo experimental study",
        "paperLink": "https://iopscience.iop.org/article/10.1088/2057-1976/ab1a82/meta",
        "authors": [
            "R Arathy",
            "PM Nabeel",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "27 May 2019",
        "conference": "Biomedical Physics & Engineering Express",
        "pages": "5",
        "publisher": "4",
        "description": "045010",
        "citations": 0
    },
    {
        "index": 39,
        "title": "Clinical validation of a wearable respiratory rate device for neonatal monitoring",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8512548/",
        "authors": [
            "A Antony Raj",
            "SP Preejith",
            "Vijai Shankar Raja",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "18 July 2018",
        "conference": "2018 40th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)",
        "pages": "1628-1631",
        "publisher": "IEEE",
        "description": "Respiratory rate monitoring is of paramount importance in neonatal care. Manual counting of expansions and contractions of the abdomen or diaphragm of the neonate is still the widely accepted measure of respiratory rate in most clinical settings. A practical, affordable, easy-to-use technology to continuously measure respiratory rate in neonates is essential to recognize the signs and symptoms of respiratory disorders. Clinical validation of a system for continuous and long term respiratory rate monitoring of neonates, in a wearable form factor with the capability of remote monitoring is presented in this paper. The respiratory rate monitor was validated in clinical settings on 10 premature babies with various disease conditions and respiratory rates varying from 25 to 90 breaths per minute. Results show a high degree of correlation between the respiratory rate measured by the device and reference measurements. An …",
        "citations": 23
    },
    {
        "index": 40,
        "title": "Experimental validation of dual PPG local pulse wave velocity probe",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7985911/",
        "authors": [
            "PM Nabeel",
            "Srinivasa Karthik",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "07 May 2017",
        "conference": "2017 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "408-413",
        "publisher": "IEEE",
        "description": "A novel dual photoplethysmograph (PPG) probe and measurement system for local pulse wave velocity (PWV) is proposed and demonstrated. The developed probe design employs reflectance PPG transducers for non-invasive detection of blood pulse propagation waveforms from two adjacent measurement points (28 mm apart). Transit time delay between the continuously acquired dual pulse waveform was used for beat-to-beat local PWV measurement. An in-vivo experimental validation study was conducted on 10 healthy volunteers (8 male and 2 female, 21 to 33 years of age) to validate the PPG probe design and developed local PWV measurement system. The proposed system was able to measure carotid local PWV from multiple subjects. Beat-to-beat variation of baseline carotid PWV was less than 7.5% for 7 out of 10 subjects, a maximum beat-to-beat variation of 16% was observed during the study …",
        "citations": 23
    },
    {
        "index": 41,
        "title": "Cataract surgery in mobile eye surgical unit: Safe and viable alternative",
        "paperLink": "https://journals.lww.com/ijo/fulltext/2016/64110/cataract_surgery_in_mobile_eye_surgical_unit__safe.9.aspx",
        "authors": [
            "Rajesh Pioneer Sangameswaran",
            "Gajendra Kumar Verma",
            "Narayanan Raghavan",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "01 November 2016",
        "conference": "Indian Journal of Ophthalmology",
        "pages": "64",
        "publisher": "11",
        "description": "835-839",
        "citations": 0
    },
    {
        "index": 42,
        "title": "Single source photoplethysmograph transducer for local pulse wave velocity measurement",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7591667/",
        "authors": [
            "PM Nabeel",
            "Jayaraj Joseph",
            "Vartika Awasthi",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "16 August 2016",
        "conference": "2016 38th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)",
        "pages": "4256-4259",
        "publisher": "IEEE",
        "description": "Cuffless evaluation of arterial blood pressure (BP) using pulse wave velocity (PWV) has received attraction over the years. Local PWV based techniques for cuffless BP measurement has more potential in accurate estimation of BP parameters. In this work, we present the design and experimental validation of a novel single-source Photoplethysmograph (PPG) transducer for arterial blood pulse detection and cycle-to-cycle local PWV measurement. The ability of the transducer to continuously measure local PWV was verified using arterial flow phantom as well as by conducting an in-vivo study on 17 volunteers. The single-source PPG transducer could reliably acquire dual blood pulse waveforms, along small artery sections of length less than 28 mm. The transducer was able to perform repeatable measurements of carotid local PWV on multiple subjects with maximum beat-to-beat variation less than 12%. The …",
        "citations": 22
    },
    {
        "index": 43,
        "title": "Electrodermal activity based classification of induced stress in a controlled setting",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8438703/",
        "authors": [
            "S Amalan",
            "A Shyam",
            "AS Anusha",
            "SP Preejith",
            "Akl Tony",
            "Joseph Jayaraj",
            "Sivaprakasam Mohanasankar"
        ],
        "publicationDate": "11 June 2018",
        "conference": "2018 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "It has become common for people to experience stress, mainly because of its eclectic nature - physical, psychological, emotional, social, etc. Unmonitored stress may prove harmful to one's health resulting in even chronic diseases. Since stress is very subjective, stress management is not straightforward. Many attempts have been made to detect and quantify stress. However, an accurate assessment can be made from physiological measurements only. In this study, we have demonstrated how electrodermal activity (EDA), which represents the sympathetic response to stress, could be used for accurate classification of stress by developing a machine learning based classification model. 30 participants were subjected to Trier Social Stress Test (TSST), and EDA and accelerometer data were recorded using a wrist-worn device. Datasets containing stress and non-stress periods were segmented and manually tagged …",
        "citations": 21
    },
    {
        "index": 44,
        "title": "An accelerometer probe for local pulse wave velocity measurement",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7985914/",
        "authors": [
            "R Arathy",
            "PM Nabeel",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam",
            "Vartika Awasthi"
        ],
        "publicationDate": "07 May 2017",
        "conference": "2017 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "426-431",
        "publisher": "IEEE",
        "description": "The velocity of propagation of arterial blood pulse signals obtained from a smaller arterial section referred as local pulse wave velocity (PWV) is an index of cardiovascular events of a particular artery. In this work, we introduce a novel design of accelerometer probe for local PWV measurement from the carotid artery. The proposed probe was developed using highly sensitive dual MEMS accelerometers. The probe design with tiny dual element sensors was capable of simultaneously acquiring acceleration signals generated due to arterial wall displacement towards the skin surface. Measurements were performed from carotid artery over a smaller arterial section of length 24 mm. The ability of the probe to acquire continuous arterial waveforms and cycle-to-cycle local PWV measurement was verified by conducting an in-vivo test in multiple subjects (11 volunteers aged between 20 – 60 years) under controlled …",
        "citations": 21
    },
    {
        "index": 45,
        "title": "A novel time-resolved fluorescent lateral flow immunoassay for quantitative detection of the trauma brain injury biomarker-glial fibrillary acidic protein",
        "paperLink": "https://pubs.rsc.org/en/content/articlehtml/2022/sd/d1sd00021g",
        "authors": [
            "Satheesh Natarajan",
            "Jayaraj Joseph"
        ],
        "publicationDate": "Invalid Date",
        "conference": "Sensors & Diagnostics",
        "pages": "1",
        "publisher": "1",
        "description": "193-197",
        "citations": 0
    },
    {
        "index": 46,
        "title": "Methodological and measurement concerns of local pulse wave velocity assessment",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8802181/",
        "authors": [
            "PM Nabeel",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "26 June 2019",
        "conference": "2019 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "Local pulse wave velocity (local PWV) provides localized information on the stiffness of a particular segment of the heterogeneous arterial bed. As a screening tool for a host of cardiovascular events and hypertension, high accuracies may not be required for the local PWV measures. However, such high accuracies are required when the yielded local PWV measures are directly used for calculations of other biomechanical and physiological parameters. There are several techniques for measuring local PWV and each possesses its own methodological challenges and considerations for ensuring accuracy. This work focuses on the salient methodological and measurement concerns of the transit time-based local PWV evaluation techniques while pinpointing the ones that are equally applicable to the other approaches. To demonstrate these concerns, we have used our extensively validated image-free ultrasound …",
        "citations": 20
    },
    {
        "index": 47,
        "title": "Evaluation of local pulse wave velocity using an image free ultrasound technique",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8438649/",
        "authors": [
            "PM Nabeel",
            "Jayaraj Joseph",
            "Malay Ilesh Shah",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "11 June 2018",
        "conference": "2018 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "Pulse wave velocity (PWV) measured over small arterial sections provide localized elastic characteristics, which helps assessment of the subtle progressions of various cardiovascular diseases. Several ultrasound-based techniques that are reported, require high frame rate imaging for performing accurate measurements of local PWV. In this work, an image free ultrasound method for evaluation of local PWV is proposed. The technique uses a novel dual element ultrasound probe for simultaneous capturing of A-scan frames (frame rate = 10 kHz) from two arterial sites located 35 mm apart. Our clinically validated ARTSENS technology was used to obtain high fidelity of distension waveforms by processing the acquired frames. The high frame rate acquisition enabled measurement of pulse transit time with a resolution of 0.1 ms for reliable evaluation of local PWV. The functionality of the developed prototype system …",
        "citations": 20
    },
    {
        "index": 48,
        "title": "Continuous weight monitoring system for ICU beds using air-filled mattresses/pads: a proof of concept",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8802148/",
        "authors": [
            "Rahul Manoj",
            "Ramdayalan Kumarasami",
            "Jayaraj Joseph",
            "Boby George",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "26 June 2019",
        "conference": "2019 IEEE international symposium on medical measurements and applications (MeMeA)",
        "pages": "1-5",
        "publisher": "IEEE",
        "description": "Fluctuations in body fluids can have adverse effects such as dehydration, swelling and related pathologies due to low maintenance of homeostasis. The risk increases if the person is critically ill and bed-ridden. Changes in body weight in short intervals is the primary indicator for body fluid imbalances. Clinical practice involves the use of a dedicated weighing scale/lift scale, detachable/built-in units of weighing scale on the legs of hospital beds and integrated bed scales. These methods have limited mobility and usability in a clinical setting or higher cost. We propose a novel sensing module integrated with air-filled mattress for monitoring human body weight at periodic intervals. The method uses the air pressure of a mattress as a measure of changes in weight. The design was made modular so that it can be easily coupled into any hospital beds. A linear fit with R2=0.98 and R2 = 0.99 was obtained respectively for …",
        "citations": 19
    },
    {
        "index": 49,
        "title": "Carotid and jugular classification in ARTSENS",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/7041165/",
        "authors": [
            "Ashish Kumar Sahani",
            "Malay Ilesh Shah",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "12 February 2015",
        "conference": "IEEE Journal of Biomedical and Health Informatics",
        "pages": "20",
        "publisher": "2",
        "description": "440-449",
        "citations": 0
    },
    {
        "index": 50,
        "title": "ARTSENS-An image-free system for noninvasive evaluation of arterial compliance",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/6610435/",
        "authors": [
            "Jayaraj Joseph",
            "Emy Anu Thomas",
            "Mohanasankar Sivaprakasam",
            "S Suresh"
        ],
        "publicationDate": "03 July 2013",
        "conference": "2013 35th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)",
        "pages": "4054-4057",
        "publisher": "IEEE",
        "description": "Evaluation of arterial compliance is significant in cardiovascular diagnosis for early detection of coronary heart disease. We present ARTSENS, an image-free system for non-invasive evaluation of arterial compliance in-vivo. The system utilizes a single element ultrasound probe with intelligent measurement algorithms to ensure accurate evaluation of local arterial compliance without an image. The ability of the system to detect artery anatomy and measure compliance was verified by in-vivo measurements conducted on 106 subjects. The accuracy of compliance estimates were evaluated by comparison with a state of art imaging system. The measurements made using ARTSENS showed strong correlation with those made using the imaging system. The ability of ARTSENS to detect age-related trends in arterial compliance was also investigated.",
        "citations": 19
    },
    {
        "index": 51,
        "title": "Long-term cardiovascular health status and physical functioning of nonhospitalized patients with COVID-19 compared with non-COVID-19 controls",
        "paperLink": "https://journals.physiology.org/doi/abs/10.1152/ajpheart.00335.2022",
        "authors": [
            "Koen M van der Sluijs",
            "Esmée A Bakker",
            "Tim J Schuijt",
            "Jayaraj Joseph",
            "Maryam Kavousi",
            "Geert-Jan Geersing",
            "Frans H Rutten",
            "Yvonne AW Hartman",
            "Dick HJ Thijssen",
            "Thijs MH Eijsvogels"
        ],
        "publicationDate": "01 January 2023",
        "conference": "American Journal of Physiology-Heart and Circulatory Physiology",
        "pages": "324",
        "publisher": "1",
        "description": "H47-H56",
        "citations": 0
    },
    {
        "index": 52,
        "title": "Deep network for capacitive ECG denoising",
        "paperLink": "https://ieeexplore.ieee.org/abstract/document/8802155/",
        "authors": [
            "Vignesh Ravichandran",
            "Balamurali Murugesan",
            "Sharath M Shankaranarayana",
            "Keerthi Ram",
            "Preejith SP",
            "Jayaraj Joseph",
            "Mohanasankar Sivaprakasam"
        ],
        "publicationDate": "26 June 2019",
        "conference": "2019 IEEE International Symposium on Medical Measurements and Applications (MeMeA)",
        "pages": "1-6",
        "publisher": "IEEE",
        "description": "Continuous monitoring of cardiac health under free living condition is crucial to provide effective care for patients undergoing post operative recovery and individuals with high cardiac risk like the elderly. Capacitive Electrocardiogram (cECG) is one such technology which allows comfortable and long term monitoring through its ability to measure biopotential in conditions without having skin contact. cECG monitoring can be done using many household objects like chairs, beds and even car seats allowing for seamless monitoring of individuals. This method is unfortunately highly susceptible to motion artifacts which greatly limits its usage in clinical practice. The current use of cECG systems has been limited to performing rhythmic analysis. In this paper we propose a novel end-to-end deep learning architecture to perform the task of denoising capacitive ECG. The proposed network is trained using motion corrupted …",
        "citations": 18
    }
]